#### 📖 Terraform Plan ('src/common/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
module.apim_itn.data.azurerm_linux_web_app.cgn_pe_backend_app_01: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [10s elapsed]
module.function_app_services.data.azurerm_linux_function_app.rf_func: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user_uat: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.session_manager_03: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [20s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [20s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [20s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.session_manager_03: Still reading... [30s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.appservice_continua: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.com_citizen_func: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [20s elapsed]
Error: Invalid count argument

  on .terraform/modules/function_app_services.function_services_dx/subnets.tf line 2, in resource "azurerm_subnet" "this":
   2:   count = local.function_app.has_existing_subnet ? 0 : 1

The "count" value depends on resource attributes that cannot be determined
until apply, so Terraform cannot predict how many instances will be created.
To work around this, use the -target argument to first apply only the
resources that the count depends on.
d-LOLLIPOP-ITN-API-KEY/60a2c540fa50468ea9fd97ef924449cc]
data.azurerm_linux_function_app.io_fims_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.fims_op_app: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [20s elapsed]
data.azurerm_linux_function_app.com_citizen_func: Still reading... [20s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [20s elapsed]
module.containers_services.module.db_subscription_cidrs_container.azurerm_cosmosdb_sql_container.this: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlDatabases/db/containers/subscription-cidrs]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.application_gateway_itn.azurerm_web_application_firewall_policy.agw will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "agw" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-itn-agw-waf-01"
        name                = "io-p-itn-agw-waf-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.application_gateway_itn.azurerm_web_application_firewall_policy.app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-itn-agw-api-app-waf-01"
        name                = "io-p-itn-agw-api-app-waf-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_app_services.azurerm_storage_container.processing-messages will be created
  + resource "azurerm_storage_container" "processing-messages" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "processing-messages"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # module.function_app_services.azurerm_storage_queue.message-created will be created
  + resource "azurerm_storage_queue" "message-created" {
      + id                   = (known after apply)
      + name                 = "message-created"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfuncsvcstfn01"
    }

  # module.function_app_services.azurerm_storage_queue.message-created-poison will be created
  + resource "azurerm_storage_queue" "message-created-poison" {
      + id                   = (known after apply)
      + name                 = "message-created-poison"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfuncsvcstfn01"
    }

  # module.function_app_services.azurerm_storage_queue.message-processed will be created
  + resource "azurerm_storage_queue" "message-processed" {
      + id                   = (known after apply)
      + name                 = "message-processed"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfuncsvcstfn01"
    }

  # module.function_app_services.azurerm_storage_queue.message-processed-poison will be created
  + resource "azurerm_storage_queue" "message-processed-poison" {
      + id                   = (known after apply)
      + name                 = "message-processed-poison"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfuncsvcstfn01"
    }

  # module.function_app_services.azurerm_storage_queue.notification-created-email will be created
  + resource "azurerm_storage_queue" "notification-created-email" {
      + id                   = (known after apply)
      + name                 = "notification-created-email"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfuncsvcstfn01"
    }

  # module.function_app_services.azurerm_storage_queue.notification-created-email-poison will be created
  + resource "azurerm_storage_queue" "notification-created-email-poison" {
      + id                   = (known after apply)
      + name                 = "notification-created-email-poison"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfuncsvcstfn01"
    }

  # module.function_app_services.azurerm_storage_queue.notification-created-webhook-poison will be created
  + resource "azurerm_storage_queue" "notification-created-webhook-poison" {
      + id                   = (known after apply)
      + name                 = "notification-created-webhook-poison"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfuncsvcstfn01"
    }

  # module.containers_services.module.db_subscription_cidrs_container.azurerm_cosmosdb_sql_container.this will be imported
    resource "azurerm_cosmosdb_sql_container" "this" {
        account_name        = "io-p-cosmos-api"
        database_name       = "db"
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlDatabases/db/containers/subscription-cidrs"
        name                = "subscription-cidrs"
        partition_key_kind  = "Hash"
        partition_key_paths = [
            "/subscriptionId",
        ]
        resource_group_name = "io-p-rg-internal"
        throughput          = 100

        autoscale_settings {
            max_throughput = 1000
        }

        conflict_resolution_policy {
            conflict_resolution_path      = "/_ts"
            conflict_resolution_procedure = null
            mode                          = "LastWriterWins"
        }

        indexing_policy {
            indexing_mode = "consistent"

            included_path {
                path = "/*"
            }
        }
    }

  # module.function_app_services.module.function_services_dx.azurerm_monitor_metric_alert.storage_account_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      + auto_mitigate            = false
      + description              = "The average availability is less than 99.8%. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[iopitnfuncsvcstfn01] Low Availability"
      + resource_group_name      = "io-p-itn-funcsvc-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 0
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Availability"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 99.8
        }
    }

  # module.function_app_services.module.function_services_dx.azurerm_private_endpoint.st_blob will be created
  + resource "azurerm_private_endpoint" "st_blob" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-funcsvc-func-blob-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-funcsvc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-funcsvc-func-blob-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.function_app_services.module.function_services_dx.azurerm_private_endpoint.st_file will be created
  + resource "azurerm_private_endpoint" "st_file" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-funcsvc-func-file-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-funcsvc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-funcsvc-func-file-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "file",
            ]
        }
    }

  # module.function_app_services.module.function_services_dx.azurerm_private_endpoint.st_queue will be created
  + resource "azurerm_private_endpoint" "st_queue" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-funcsvc-func-queue-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-funcsvc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-funcsvc-func-queue-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

  # module.function_app_services.module.function_services_dx.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "italynorth"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "io-p-itn-funcsvc-asp-01"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "io-p-itn-funcsvc-rg-01"
      + sku_name                        = "P1v3"
      + tags                            = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + worker_count                    = (known after apply)
      + zone_balancing_enabled          = true
    }

  # module.function_app_services.module.function_services_dx.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = true
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "italynorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopitnfuncsvcstfn01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-itn-funcsvc-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = false
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.github_runner_itn.module.container_app_github_runner.azurerm_container_app_job.github_runner will be updated in-place
  ~ resource "azurerm_container_app_job" "github_runner" {
        id                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-github-runner-rg-01/providers/Microsoft.App/jobs/io-p-itn-io-infra-caj-01"
        name                         = "io-p-itn-io-infra-caj-01"
      ~ tags                         = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "github_selfhosted_runner_on_container_app_jobs"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "1.1.1" -> "1.1.2"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (8 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.networking_services.module.services_snet.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.20.33.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-p-itn-services-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-p-itn-common-rg-01"
      + service_endpoints                             = [
          + "Microsoft.AzureCosmosDB",
          + "Microsoft.Storage",
          + "Microsoft.Web",
        ]
      + virtual_network_name                          = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
        name                          = "io-p-itn-platform-api-gateway-apim-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.2.2"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (21 unchanged attributes hidden)

      ~ hostname_configuration {
          ~ proxy {
              ~ default_ssl_binding             = true -> false
                # (12 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.data.azurerm_private_dns_zone.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.servicebus.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-evt-rg"
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.azurerm_private_endpoint.service_bus_pep[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "service_bus_pep" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01"
        name                          = "io-p-itn-platform-sbns-pep-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_service_bus_namespace"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.0.4"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01/privateDnsZoneGroups/private-dns-zone-group"
            name                 = "private-dns-zone-group"
          ~ private_dns_zone_ids = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-evt-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ] -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_admins[0].module.storage_account.azurerm_role_assignment.blob["iopstexportdata|*|writer"] will be destroyed
  # (because key ["iopstexportdata|*|writer"] is not in for_each map)
  - resource "azurerm_role_assignment" "blob" {
      - description                            = "Allow IO Comunicazione Admins to manage blob files" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata/providers/Microsoft.Authorization/roleAssignments/70560df9-8d2e-a699-6ed4-bfee93664fa4" -> null
      - name                                   = "70560df9-8d2e-a699-6ed4-bfee93664fa4" -> null
      - principal_id                           = "12a48460-7d95-4d91-ab0a-1d19008aac2c" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> null
      - role_definition_name                   = "Storage Blob Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata" -> null
        # (3 unchanged attributes hidden)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_admins[0].module.storage_account.azurerm_role_assignment.blob["iopstexportdata|*|writer|PagoPA Storage Blob Tags Contributor"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Allow IO Comunicazione Admins to manage blob files"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12a48460-7d95-4d91-ab0a-1d19008aac2c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Storage Blob Tags Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_admins[0].module.storage_account.azurerm_role_assignment.blob["iopstexportdata|*|writer|Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Allow IO Comunicazione Admins to manage blob files"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12a48460-7d95-4d91-ab0a-1d19008aac2c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_admins[0].module.storage_account.azurerm_role_assignment.table["iopstexportdata|*|writer"] will be destroyed
  # (because key ["iopstexportdata|*|writer"] is not in for_each map)
  - resource "azurerm_role_assignment" "table" {
      - description                            = "Allow IO Comunicazione Admins to manage tables" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata/providers/Microsoft.Authorization/roleAssignments/fca594de-f1f8-31ea-287b-0864d4363703" -> null
      - name                                   = "fca594de-f1f8-31ea-287b-0864d4363703" -> null
      - principal_id                           = "12a48460-7d95-4d91-ab0a-1d19008aac2c" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/0a9a7e1f-b9d0-4cc4-a60d-0319b160aaa3" -> null
      - role_definition_name                   = "Storage Table Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata" -> null
        # (3 unchanged attributes hidden)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_admins[0].module.storage_account.azurerm_role_assignment.table["iopstexportdata|*|writer|Storage Table Data Contributor"] will be created
  + resource "azurerm_role_assignment" "table" {
      + condition_version                = (known after apply)
      + description                      = "Allow IO Comunicazione Admins to manage tables"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12a48460-7d95-4d91-ab0a-1d19008aac2c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Table Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_devs[0].module.storage_account.azurerm_role_assignment.blob["iopstexportdata|*|writer"] will be destroyed
  # (because key ["iopstexportdata|*|writer"] is not in for_each map)
  - resource "azurerm_role_assignment" "blob" {
      - description                            = "Allow IO Comunicazione Devs to manage blob files" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata/providers/Microsoft.Authorization/roleAssignments/be23521b-80e3-ab4e-9e92-bb702291ed3c" -> null
      - name                                   = "be23521b-80e3-ab4e-9e92-bb702291ed3c" -> null
      - principal_id                           = "7b78851b-c40d-497d-ae7f-596b8f92ecf2" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> null
      - role_definition_name                   = "Storage Blob Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata" -> null
        # (3 unchanged attributes hidden)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_devs[0].module.storage_account.azurerm_role_assignment.blob["iopstexportdata|*|writer|PagoPA Storage Blob Tags Contributor"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Allow IO Comunicazione Devs to manage blob files"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7b78851b-c40d-497d-ae7f-596b8f92ecf2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Storage Blob Tags Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_devs[0].module.storage_account.azurerm_role_assignment.blob["iopstexportdata|*|writer|Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Allow IO Comunicazione Devs to manage blob files"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7b78851b-c40d-497d-ae7f-596b8f92ecf2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_devs[0].module.storage_account.azurerm_role_assignment.table["iopstexportdata|*|writer"] will be destroyed
  # (because key ["iopstexportdata|*|writer"] is not in for_each map)
  - resource "azurerm_role_assignment" "table" {
      - description                            = "Allow IO Comunicazione Devs to manage tables" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata/providers/Microsoft.Authorization/roleAssignments/152468ab-ec74-9802-70a9-45000d2be43b" -> null
      - name                                   = "152468ab-ec74-9802-70a9-45000d2be43b" -> null
      - principal_id                           = "7b78851b-c40d-497d-ae7f-596b8f92ecf2" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/0a9a7e1f-b9d0-4cc4-a60d-0319b160aaa3" -> null
      - role_definition_name                   = "Storage Table Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata" -> null
        # (3 unchanged attributes hidden)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_devs[0].module.storage_account.azurerm_role_assignment.table["iopstexportdata|*|writer|Storage Table Data Contributor"] will be created
  + resource "azurerm_role_assignment" "table" {
      + condition_version                = (known after apply)
      + description                      = "Allow IO Comunicazione Devs to manage tables"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7b78851b-c40d-497d-ae7f-596b8f92ecf2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Table Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts_itn.module.retirements_itn_01_admins[0].module.storage_account.azurerm_role_assignment.blob["iopitnretirementsst01|*|owner"] will be destroyed
  # (because key ["iopitnretirementsst01|*|owner"] is not in for_each map)
  - resource "azurerm_role_assignment" "blob" {
      - description                            = "Allow IO Admins to manage blob files" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnretirementsst01/providers/Microsoft.Authorization/roleAssignments/7f994aa2-3d66-5f45-0921-86f920335d2b" -> null
      - name                                   = "7f994aa2-3d66-5f45-0921-86f920335d2b" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnretirementsst01" -> null
        # (3 unchanged attributes hidden)
    }

  # module.storage_accounts_itn.module.retirements_itn_01_admins[0].module.storage_account.azurerm_role_assignment.blob["iopitnretirementsst01|*|owner|Storage Blob Data Owner"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Allow IO Admins to manage blob files"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnretirementsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts_itn.module.retirements_itn_01_admins[0].module.storage_account.azurerm_role_assignment.table["iopitnretirementsst01|*|owner"] will be destroyed
  # (because key ["iopitnretirementsst01|*|owner"] is not in for_each map)
  - resource "azurerm_role_assignment" "table" {
      - description                            = "Allow IO Admins to manage tables" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnretirementsst01/providers/Microsoft.Authorization/roleAssignments/8cac3bab-b89e-e5e5-9693-16a938b77638" -> null
      - name                                   = "8cac3bab-b89e-e5e5-9693-16a938b77638" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/0a9a7e1f-b9d0-4cc4-a60d-0319b160aaa3" -> null
      - role_definition_name                   = "Storage Table Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnretirementsst01" -> null
        # (3 unchanged attributes hidden)
    }

  # module.storage_accounts_itn.module.retirements_itn_01_admins[0].module.storage_account.azurerm_role_assignment.table["iopitnretirementsst01|*|owner|Storage Table Data Contributor"] will be created
  + resource "azurerm_role_assignment" "table" {
      + condition_version                = (known after apply)
      + description                      = "Allow IO Admins to manage tables"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Table Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnretirementsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to import, 23 to add, 6 to change, 6 to destroy.

Warning: Argument is deprecated

  with module.apim_itn.module.apim.azurerm_api_management.this,
  on .terraform/modules/apim_itn.apim/main.tf line 18, in resource "azurerm_api_management" "this":
  18: resource "azurerm_api_management" "this" {

`key_vault_id` has been deprecated in favour of `key_vault_certificate_id`
and will be removed in v5.0 of the AzureRM provider

(and 23 more similar warnings elsewhere)
::error::Terraform exited with code 1.
```

</details>
